Revit 2027 API
MEPNetworkSegmentId Constructor
Overload List
Name | Description
MEPNetworkSegmentId() |  Creates a default invalid segment id on the network.
MEPNetworkSegmentId(ElementId, Int32) |  Creates a valid segment id on the network.
Top
See Also
Reference
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace